// 15 位身份证号: 6 位地区号, 2 位年份后两位, 2 位月份, 2 位日子, 3 位顺序码(最后一位奇数为男偶数为女)
exports.REG_IDNO_15 = /^([1-9]\d{5})(\d{2})((?:0[1-9])|(?:10|11|12))((?:[0-2][1-9])|10|20|30|31)\d{3}$/

// 18 位身份证号: 6位地区号, 4位年份, 2位月份, 2位日子, 3位顺序码, 1位校验码
exports.REG_IDNO_18 = /^([1-9]\d{5})((?:19|20)\d{2})((?:0[1-9])|(?:10|11|12))((?:[0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/

// 校验码
exports.IDNO_VS = ['1', '0', 'x', '9', '8', '7', '6', '5' ,'4', '3', '2']

// 加权因子
exports.IDNO_PS = ['7', '9', '10', '5', '8', '4', '2', '1' ,'6', '3', '7', '9', '10', '5', '8', '4', '2']

// 银行卡号
exports.REG_BANKCARD = /^\d{16,19}$/

// 银行列表
exports.BANK_LIST = [
  { name: '工商银行', prefix: '622202' },
  { name: '农业银行', prefix: '622848' },
  { name: '建设银行', prefix: '622700' },
  { name: '交通银行', prefix: '622262' },
  { name: '中国银行', prefix: '621661' },
  { name: '光大银行', prefix: '622666' },
  { name: '民生银行', prefix: '622622' },
  { name: '广东发展银行', prefix: '622556' },
  { name: '招商银行', prefix: '622588' },
  { name: '深圳平安银行', prefix: '622155' },
  { name: '中信银行', prefix: '622689' },
  { name: '华夏银行', prefix: '622630' },
  { name: '兴业银行', prefix: '622908' },
]

// 手机号
exports.REG_PHONE = /^(00|11|13|14|15|16|17|18|19)[0-9]{9}$/

exports.FAMILY_NAME_LIST = ["赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈", "褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许", "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏", "陶", "姜", "戚", "谢", "邹", "喻", "柏", "水", "窦", "章", "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁", "韦", "昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳", "酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺", "倪", "汤", "滕", "殷", "罗", "毕", "郝", "邬", "安", "常", "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余", "元", "卜", "顾", "孟", "平", "黄", "和", "穆", "萧", "尹","诸葛","上官","操"]

exports.GIVEN_NAME_LIST = ["子璇", "淼", "国栋", "夫子", "瑞堂", "甜", "敏", "尚", "国贤", "贺祥", "晨涛", "昊轩", "易轩", "益辰", "益帆", "益冉", "瑾春", "瑾昆", "春齐", "杨", "文昊", "东东", "雄霖", "浩晨", "熙涵", "溶溶", "冰枫", "欣欣", "宜豪", "欣慧", "建政", "美欣", "淑慧", "文轩", "文杰", "欣源", "忠林", "榕润", "欣汝", "慧嘉", "新建", "建林", "亦菲", "林", "冰洁", "佳欣", "涵涵", "禹辰", "淳美", "泽惠", "伟洋", "涵越", "润丽", "翔", "淑华", "晶莹", "凌晶", "苒溪", "雨涵", "嘉怡", "佳毅", "子辰", "佳琪", "紫轩", "瑞辰", "昕蕊", "萌", "明远", "欣宜", "泽远", "欣怡", "佳怡", "佳惠", "晨茜", "晨璐", "运昊", "汝鑫", "淑君", "晶滢", "润莎", "榕汕", "佳钰", "佳玉", "晓庆", "一鸣", "语晨", "添池", "添昊", "雨泽", "雅晗", "雅涵", "清妍", "诗悦", "嘉乐", "晨涵", "天赫", "玥傲", "佳昊", "天昊", "萌萌", "若萌"]

exports.REGION_LIST = [
  { "code": "11", "name": "北京" },
  { "code": "12", "name": "天津" },
  { "code": "13", "name": "河北" },
  { "code": "14", "name": "山西" },
  { "code": "15", "name": "内蒙古" },
  { "code": "21", "name": "辽宁" },
  { "code": "22", "name": "吉林" },
  { "code": "23", "name": "黑龙江" },
  { "code": "31", "name": "上海" },
  { "code": "32", "name": "江苏" },
  { "code": "33", "name": "浙江" },
  { "code": "34", "name": "安徽" },
  { "code": "35", "name": "福建" },
  { "code": "36", "name": "江西" },
  { "code": "37", "name": "山东" },
  { "code": "41", "name": "河南" },
  { "code": "42", "name": "湖北" },
  { "code": "43", "name": "湖南" },
  { "code": "44", "name": "广东" },
  { "code": "45", "name": "广西" },
  { "code": "46", "name": "海南" },
  { "code": "50", "name": "重庆" },
  { "code": "51", "name": "四川" },
  { "code": "52", "name": "贵州" },
  { "code": "53", "name": "云南" },
  { "code": "54", "name": "西藏" },
  { "code": "61", "name": "陕西" },
  { "code": "62", "name": "甘肃" },
  { "code": "63", "name": "青海" },
  { "code": "64", "name": "宁夏" },
  { "code": "65", "name": "新疆" },
  { "code": "71", "name": "台湾" },
  { "code": "81", "name": "香港" },
  { "code": "82", "name": "澳门" },
  { "code": "91", "name": "海外" },
]